import cv2
import numpy as np

img = np.zeros((480, 640 ,3),np.uint8)

# 画线, 坐标点为(X,Y)
# line(图像, 起点坐标, 终点坐标, 颜色, 线宽, 线型)
cv2.line(img,(10,20),(300,400),(0,0,255),5,4)

# 画矩形
cv2.rectangle(img, (10, 10), (100,100), (0, 0, 255), -1)

# 画圆
cv2.circle(img, (320, 240), 100, (0, 0, 255))
# 画圆 内部填充
cv2.circle(img, (320, 240), 20, (0, 0, 255), -1)

# 画椭圆 
# 图像  长与高为矩形的一半  矩形角度(椭圆角度)  扇形起始角度  扇形终止角度  颜色  填充
# cv2.ellipse(img, (320, 240), (100, 50), 0, 0, 360, (0, 0, 255), -1)
# 只画扇形角度的180 度是顺时针计算的 o度是从右侧开始的
# cv2.ellipse(img, (320, 240), (100, 50), 0, 0, 180, (0, 0, 255), -1)
# 将椭圆的角度设为90, 即顺时针旋转90度 
# cv2.ellipse(img, (320, 240), (100, 50), 90, 0, 90, (0, 0, 255), -1)
# 扇形区域是在椭圆角度的基础上进行的起始角度 这里将扇形起始设为45度
cv2.ellipse(img, (320, 240), (100, 50), 90, 45, 90, (0, 0, 255), -1)

# 画多边形
# 图像 点集 是否闭环 颜色  
# 创造点集 类型必须是int32
pts = np.array([(300, 10), (150, 100), (450, 100)], np.int32)
cv2.polylines(img, [pts], True, (0, 0, 255))

# 填充多边形
cv2.fillPoly(img, [pts], (255, 0, 0))

# 绘制文本 
# 图像 字符串 起始点 字体 字号 颜色
cv2.putText(img, "Hello World", (10, 400), cv2.FONT_HERSHEY_PLAIN, 3, (255, 0, 0))

cv2.imshow('draw', img)
cv2.waitKey(0)